{
    "prologue": {
        "narrator": {
            "text": [
                "Ọmọtẹmi awakens to an endless expanse of swirling mist. The ground beneath her feet is neither earth nor air, yet it holds her firmly. She breathes in, and the air is thick with something unfamiliar—power, ancient and boundless.",
                "She does not remember how she arrived here. The last thing she recalls is… nothing. A void where her memories should be.",
                "As she takes her first step, the mist begins to shift. Tiny glowing motes of light dance in the air, pulsing like distant stars. One of them, larger than the rest, floats toward her, hovering just beyond her reach.",
                "A voice, soft yet infinite, hums in her mind, not through sound, but through understanding."
            ],
            "scene_description": "A boundless, misty void where time feels nonexistent. Ethereal lights flicker as something ancient stirs.",
            "scene_image": "spirit_realm_awakening.png",
            "scene_audio": "whispers_of_the_spirit.mp3"
        }
    },
    "life_spirit_intro": {
        "narrator": {
            "text": [
                "‘Ọmọtẹmi…’ the voice calls, not from the mist, not from the light, but from within her own soul.",
                "‘You are awake at last. You have crossed the veil that separates your world from the unseen. You stand at the threshold of fate.’",
                "Ọmọtẹmi feels no fear, only a quiet understanding. The light before her pulses, as though waiting.",
                "‘I am the Life Spirit,’ the voice continues, ‘a guide to those who seek the path before them. And you… you have a path unlike any other.’",
                "The mist shifts again, revealing glimpses of places unknown—ancient temples, burning skies, shadows moving between realms.",
                "‘You have been chosen,’ the voice whispers. ‘Chosen to walk where few dare tread. To heal what is broken. To fight where others have fallen. But first… you must listen.’",
                "The light drifts forward, touching Ọmọtẹmi’s chest. A warmth spreads through her, and the light dissolves, merging into her being.",
                "‘I will be with you always,’ the voice assures her, now fully within her own spirit. ‘You will never walk alone.’"
            ],
            "scene_description": "The Life Spirit appears as a floating light, merging into Ọmọtẹmi as she accepts her destiny. Visions of her journey flicker in the mist.",
            "scene_image": "life_spirit_merging.png",
            "scene_audio": "ethereal_guidance.mp3"
        }
    },
    "obatala_calling": {
        "narrator": {
            "text": [
                "A deep, resonant voice cuts through the mist, rich and powerful, yet kind.",
                "‘Ọmọtẹmi… come to me.’",
                "A ripple moves through her spirit, as though something beyond this realm is calling her forward.",
                "‘He calls for you,’ the voice of the Life Spirit murmurs from within. ‘The father of purity, the sculptor of all things formed. Òbàtálá awaits.’",
                "The mist parts like a great ocean, revealing a path of white stone stretching into the endless horizon.",
                "‘Follow the path, Ọmọtẹmi. Your journey begins now.’"
            ],
            "scene_description": "The voice of Òbàtálá echoes through the Spirit World, calling Ọmọtẹmi forward. A path of pure white stone materializes before her.",
            "scene_image": "obatala_path_revealed.png",
            "scene_audio": "divine_calling.mp3"
        }
    }
}
